Revit 2026 API
Document.EditFamily Method
Gets the document of a loaded family to edit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Document EditFamily(
	Family loadedFamily
)
Public Function EditFamily (
	loadedFamily As Family
) As Document
public:
Document^ EditFamily(
	Family^ loadedFamily
)
member EditFamily :
        loadedFamily : Family -> Document
Parameters
loadedFamily Family
The loaded family in current document.
Return Value
Document
Reference of the document of the family.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"loadedFamily"-is null.
ArgumentException |  Thrown when the input argument-"loadedFamily"-is an in-place family or a non-editable family. (This can be checked with the IsInPlace and IsEditable properties of the Family class.
InvalidOperationException |  Thrown when the family is already being edited.
ForbiddenForDynamicUpdateException |  Thrown if this method is called during dynamic update.
InvalidOperationException |  Thrown if this method is called while the document is modifiable (i.e. it has an unfinished transaction.)
InvalidOperationException |  Thrown if this method is currently in a read-only state.
Remarks
This creates an independent copy of the family for editing. To apply the changes back to the family stored in the document, use the LoadFamily overload accepting IFamilyLoadOptions.
This method may not be called if the document is currently modifiable (has an open transaction) or is in a read-only state. The method may not be called during dynamic updates. To test the document's current status, check the values of IsModifiable and IsReadOnly properties.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace